#1. Введіть з клавіатури в масив 5 цілочисельних значень. Виведіть їх в
#один рядок через кому. Отримайте для масиву середнє арифметичне.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy.

while True:
    while True:
        A=np.zeros(5, dtype=int) #Ініціалізуємо пусту матрицю.
        for i in range(len(A)): #Отримуємо доступ до елементів матриці А.
            try: #Перевірка на входження чисел.
                A[i] =int(input(f'Число {i+1}: ')) #Заповнюємо числами.
                continue
            except ValueError:
                print('Input numbers!! ')
                break
        
        print('Послідовність: ')
        for i in range(len(A)): #Знову отримаємо доступ до елементів.
            if i == len(A) - 1: #Для того, щоб вивести елементи у ряд з комами,\
                #ми повинні виключити останній елемент, так як команда end \
                #поставить коми після кожного елементу, включаючи останній.
                print(A[i], end="\n")
            else:
                print(A[i], end=", ")

        print(np.mean(A)) #Знаходимо середнє значення.

        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break



            


    
