#10. Дані про температуру повітря за декаду листопада зберігаються в масиві.
#Визначити, скільки разів температура опускалася нижче -10 градусів.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо три декади листопада за допомогою random.
    A1=np.array([random.randint(-13,5) for i in range(1,11)])
    A2=np.array([random.randint(-14,5) for i in range(1,11)])
    A3=np.array([random.randint(-15,5) for i in range(1,11)])

    #Виведемо всі три декади.
    print('Перша декада листопада: ', A1)
    print('Друга декада листопада: ', A2)
    print('Третя декада листопада: ', A3)

    count=0 #Запустимо лічильник для підрахунку температури, що була менше -10.
    for i in range(len(A1)): #Отримаємо доступ до елементів.
        if A1[i]<-10: #Умова, якщо температура менше -10.
            count+=1 #Якщо ТАК, то у лічильник додамо 1.
    #Виведемо скільки разів у першу декаду температура була нижчою, нід -10.
    print(f'За першу декаду лиситопада температура менша, ніж -10 \
була {count} разів.')
    
    #Аналогічно і другою та третьою декадами листопада.
    count1=0
    for i in range(len(A2)):
        if A2[i]<-10:
            count1+=1
    print(f'За другу декаду лиситопада температура менша, ніж -10 \
була {count1} разів.')


    count2=0
    for i in range(len(A3)):
        if A3[i]<-10:
            count2+=1
    print(f'За третю декаду лиситопада температура менша, ніж -10 \
була {count2} разів.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

    

    

