#11. Дані про температуру води на Чорноморському узбережжі за декаду
#вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для
#купання.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо три декади вересня за допомогою random.
    A1=np.array([random.randint(14,25) for i in range(1,11)])
    A2=np.array([random.randint(12,24) for i in range(1,11)])
    A3=np.array([random.randint(10,22) for i in range(1,11)])

    #Виведемо всі три декади.
    print('Температура води від 1-10 вересня', A1)
    print('Температура води від 11-20 вересня', A2)
    print('Температура води від 21-30 вересня', A3)

    print()
    print('Експерти радять купатися у морі, якщо температруа \
води від 20 до 24 градусів!')

    print()
    count=0 #ЗАПУСТИМО ЛІЧИЛЬНИК.   
    for i in range(len(A1)): #Отримаємо доступ до елементів першої декади.
        if 20<=A1[i]<=25: #Якщо елемент знаходиться у діапазоні 20 та 25, \
            #то купатись можна;)
            count+=1 #Отже, якщо вода тепла, то у лічильник +1.
    if 1<=count<=10: #Якщо count!=0, то купатись можна було, else - ні.
        print(f'Купатися у перших числах вересня можна було стільки: {count}.')
    else:
        print('За першу декаду листопада вода у морі була непридатна для купання.')

    print()
    #Аналогічно і з іншими декадами.
    counter=0
    for i in range(len(A2)):
        if 20<=A2[i]<=24:
            counter+=1
    if 1<=counter<=10:
        print(f'Купатися у середині вересня можна було стільки: {counter}.')
    else:
        print('За другу декаду листопада вода у морі була непридатна для купання.')


    print()
    counterr=0
    for i in range(len(A3)):
        if 20<=A3[i]<=22:
            counterr+=1
    if 1<=counterr<=10:
        print(f'Купатися у кінці вересня можна було стільки: {counterr}.')
    else:
        print('За третю декаду листопада вода у морі була непридатна для купання.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

    
