#12. Дані про температуру повітря за декаду грудня зберігаються в масиві.
#Визначити, скільки раз температура була вище середньої за цю декаду.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо наші три декади грудня.
    A1=np.array([random.randint(-3,8) for i in range(1,11)])
    A2=np.array([random.randint(-10,5) for i in range(1,11)])
    A3=np.array([random.randint(-18,-3) for i in range(1,12)])

    #Знаходимо їх середні значення та виводимо безпосередньо саму декаду.
    print(f'Від 1-го до 10 грудня температура була такою: {A1}')
    print(f'Середнє значення: {np.mean(A1)}')
    print()
    print(f'Від 11-го по 20 грудня температура була такою: {A2}')
    print(f'Середнє значення: {np.mean(A2)}')
    print()
    print(f'Від 21-го по 30 грудня температура була такою: {A3}')
    print(f'Середнє значення: {np.mean(A3)}')
    print()

    count=0 
    for i in range(len(A1)): #Отримаємо доступ до елементів.
        if np.mean(A1)<A1[i]: #Перевірка на те, щоб температура була вищою, \
            #ніж середнє значення теператур за першу декаду.
            count+=1 #Якщо умова True, то лічильник +1.
    #Виведемо кількість таких теператур.
    print(f'Температура за перші дні грудня була \
вищою за середню стільки разів: {count}.')


    print()
    #Аналогічно і з іншими декадами.
    count1=0
    for i in range(len(A2)):
        if np.mean(A2)<A2[i]:
            count1+=1
    print(f'Температура за 11-20 грудня була \
вищою за середню стільки разів: {count1}.')


    print()
    count2=0
    for i in range(len(A3)):
        if np.mean(A3)<A3[i]:
            count2+=1
    print(f'Температура за кінець грудня була \
вищою за середню стільки разів: {count2}.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break


        

