#13. Створіть масив з 15 цілочисельних елементів і визначте серед них
#мінімальне значення.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив А.
    A=np.array([random.randint(-15,20) for i in range(1,15)])
    print('Масив: ', A) #Виводим його на екран.

    print('Мінімальне значення: ', min(A)) #Знаходимо його мін. значення.

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
