#14. Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
#пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy.

while True:
    while True:
        A=np.zeros(10, dtype=int) #Ініціалізуємо масив нулями.

        lst=[] #Створимо порожній список, а потім додамо у нього елементи.
        for i in range(len(A)): #Отримаємо доступ до елементів масиву.
            try: #Перевірка на входження чисел.
                A=int(input('Введіть час для обрахунку 10-ти відстаней (H): '))
                H=A*A*10/2 #Формула для обрахунку відстані.
                lst.append(int(H)) #Додамо у список результати обчислень.
                continue
            except ValueError:
                print('Input numbers!! ')
                break

        #Виведемо ці відстані.
        print('Масив з 10-ма відстанями (H): ', lst)

        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break

    
    
    
