#15. Знайти суму парних елементів масиву цілих чисел. Розмірність масиву - 20.
#Заповнення масиву здійснити випадковими числами від 100 до 200.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами.
    A=np.array([random.randint(100,200) for i in range(20)])
    print('Масив: ', A) #Виводим його на екран.

    count=0 # лічильник будемо додавати наші True елементи.
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%2==0: #Якщо елемент парний, то ми додаємо його у count.
            count+=A[i]
            #Виведемо count
    print('Сума парних елементів: ', count)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

        
