#16. Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
#масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо числами наш масив А.
    A=np.array([random.randint(10,50) for i in range(15)])
    print('Масив: ', A) #Виводимо на екран масив А.

    count=1 #Лічильник буде обраховувати добуток елементів, що будуть True \
    #за умовою if. count=1 тому, що якщо б був 0, то добуток завжди дорівнював\
    # нулю, оскільки будь-яке число помножити на 0 - буде 0.
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%7==0: #Перевірка чи число кратне 7.
            count*=A[i] #Якщо так, то множим його у count.

    #Якщо count==1, то чисел, кратних 7 немає у масиві.
    if count==1:
        print('Чисел, кратних 7 немає у масиві!')
    else:
        print('Добуток парних елементів: ', count)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
        



        
