#17. Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
#Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100
#до 200.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив дійсними числами.
    A=np.array([random.uniform(100,200) for i in range(20)])
    print('Масив: ', A) #Виведемо масив на екран.

    count=0
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if i%2==1: #Непарність індексу.
            count+=A[i] #Додамо у count число, що стоїть під непарним індексом.
    print('Сума непарних елементів: ', count)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
        
