#18. Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність
#масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy.

while True:
    while True:
        #Ініціалізуємо матрицю нулями.
        A=np.zeros(10, dtype=int)

        multiply=1 #лічильник = 1, тому, щоб при множенні ми отримали число,\
        #якщо ми поставимо multuply=0, то при множенні на будь-яке число будемо\
        #отримувати 0.
        for i in range(len(A)): #Отримаємо доступ до елементів масиву.
            try: #Перевірка на входження чисел.
                A[i]=int(input('Введіть елемент масиву: '))
                if A[i]<0: #Множимо усі від'ємні числа.
                    multiply*=A[i]
                    continue
            except ValueError:
                print('Input numbers!! ')
                break
                

        if multiply==1: #Якщо лічильник так і залишився 0, то у масиві не було\
            #від'ємних чисел.
            print("Немає від'ємних чисел")
        else:
            print("Добуток від'ємних чисел", multiply)

        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break

            
