#2. Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на
#екран значення кореня і квадратів кожного з елементів масиву.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy.

while True:
    while True:
        A=np.zeros(5, int) #Ініціалізуємо пусту матрицю.
        for i in range(len(A)): #Отримуємо доступ до елементів матриці А.
            try: #Перевірка на входження чисел.
                A[i] =int(input(f'Число {i+1}: ')) #Заповнюємо числами.
                continue
            except ValueError:
                print('Input numbers!! ')
                break

        B=A #створимо поверхневі копії для зручності.
        C=A


        print('Квадрати чисел: ' )
        for i in range(len(B)): #Отримуємо доступ до елементів матриці B.
            B=map(lambda i: i*i, B) #Через lambda обрахуємо квадрати коренів.
            for i in B: #Оскільки lambda - функція анонімна, то елементи \
                #послідовності можна отримати лише так.
                print(i, end=' ')
        print()

        print('Корені чисел: ')
        for k in range(len(C)): #Отримуємо доступ до елементів матриці C.
            C=map(lambda k: k**0.5, C) #Аналогічно і для кореня.
            for k in C:
                print(k, end=' ')

        print()

        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break

        

                
