#20. Знайти суму всіх елементів масиву дійсних чисел, більших за задане
#число. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами
#від 50 до 100.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    while True:
        #Генеруємо масив дійними числами.
        A=np.array([random.uniform(50,100) for i in range(20)])
        print('Масив: ', A) #Виведемо наш масив.
        print()

        #Користувач вводить "задане число".
        try:
            n=int(input('Задайте будь-яке ціле число не більше 100: '))
        except ValueError:
            print('Input numbers!! ')
            break

        count=0
        for i in range(len(A)):
            if A[i]>n: #Якщо елемент масиву більший, ніж "задане число", то:
                count+=A[i] #ми його додаємо у count.

        print(f'Знайдемо суму чисел, більших від {n}.')
        #Якщо count так і залишився 0, то таких чисел не зустрілось у масиві.
        if count==0:
            print(f'Немає чисел у масиві, більших, ніж {n}.')
        else:
            print(f'Сума чисел, які більші, ніж {n} буде {count}.')


        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break
