#22. Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.
#Заповнення масиву здійснити випадковими числами від 5 до 500.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив елементами.
    A=np.array([random.randint(5,500) for i in range(10)])
    print('Масив: ', A)

    multiply=1 #лічильник = 1, щоб при множенні отримувати добуток чисел.
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%3==0 and A[i]%9==0: #Якщо число кратне 3 і 9, то :
            multiply*=A[i] #Множимо його у наш лічильник.
            print(f'Числа, кратні 3 та 9 - {A[i]}.')

    #Якщо лічильник так і дорівнює 1, то чисел, кратних 3 і 9 немає у масиві.
    if multiply==1:
        print('У масиві немає чисел, кратних 3 і 9.')
    else:
        print('Добуток елементів масиву, які кратні 3 та 9: ', multiply)


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

        
