#24. Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
#одночасно. Розмірність масиву - 30. Заповнення масиву здійснити випадковими
#числами від 500 до 1000.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(500,1000) for i in range(30)])
    print('Масив: ', A)

    example=0
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%5==0 and A[i]%8==0: #Якщо елемент кратний 5 та 8, то:
            example+=A[i] #додамо ії у лічильник.
            print(f'Числа, кратні 5 та 8 {A[i]}')

    #Якщо лічильник залишився 0, то елементів у масиві, кратним 5 та 8 - немає.
    if example==0:
        print('Чисел, кратних 5 та 8 у масиві немає.')
    else:
        print(f'Сума чисел, кратних 5 та 8 - {example}.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
        
    
