#25. Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
#Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до
#100.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(10,100) for i in range(10)])
    print('Масив: ', A)

    multiply=1
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%5==0: #Якщо елемент масиву кратний 5, то:
            multiply*=A[i] #домножимо його у лічильник.

    #Якщо лічильник залишився 1, то елементів у масиві, кратним 5 - немає.
    if multiply==1:
        print('Чисел, кратних 5 у масиві немає.')
    else:
        print(f'Добуток елементів масиву, кратниx 5 - {multiply}.')


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
        
