#27. Лінійний масив містить відомості про кількість опадів, що випали за
#кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість
#опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих
#місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо к-сть опадів для кодного місяця року.
    A=np.array([random.randint(15, 90) for i in range(12)])
    print('Кількість опадів у кожному місяці: ', A)
    print()

    count=0
    count1=0
    for i in range(len(A)): #тримаємо доступ до елементів масиву.
        count+=A[i] #Підрахуємо загальну к-сть опадів за рік
        if A[i]<30: #Підрахуємо посушливі місяці (менше 30 мм).
            count1+=1

    #Виведемо усі результати на екран.        
    print('Загальна кількість опадів протягом року: ', count)
    print('Середньомісячна кількість опадів: ', np.mean(A))
    print('Кількість посушливих місяців (менше 30мм): ', count1)
    print(f'Кількість опадів у найпосушливішому місяці року: {min(A)}.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

    

        
