#28. Знайти кількість парних елементів одновимірного масиву.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(100,500) for i in range(20)])
    print('Масив: ', A)


    count=0
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]%2==0: #Якщо елемент масиву парний, то:
            count+=1 #Кількість лічильника збільшиться на 1.

    #Якщо лічильник залишився 0, то парних елементів у масиві немає.
    if count==0:
        print('У масиві не зустрілось жодного парного елементу.')
    else:
        print(f'У масиві зустрілось парних елементів: {count}.')


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
