#3. Створіть масив з 5 прізвищ і виведіть їх на екран стовпчиком,
#починаючи з останнього.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy.

while True:
    #Задаємо прізвища у масиві.
    A=np.array(['Суханов', 'Горбатюк', 'Сауляк', 'Нагієв', 'Меладзе'])
    H=A[::-1] #Спочатку їх "перевернемо".
    print('Прізвища: ', A) #Виведемо default прізвища.

    for i in H: #Щоб вивести прізвища стовчиком, використаємо цикл.
        print(i)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

