#30. Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які розташовані за першим по порядку мінімальним елементом.

while True:
    import numpy as np #Імпортуємо необхідні модулі.
    import random

    #Ініціалізуємо нашу матрицю.
    A=np.array([random.randint(1,30) for i in range(20)])

    print('Масив: ', A)

    #Шукаємо мінімальне значення у масиві.
    A_min=min(A)
    print('Мінімальне значення: ', A_min)

    #"Перевернемо" наш масив, для того, щоб знаходити суму елементів до мінімального\
    #значення і при його знаходженні "обірвати" прохід по елементам за допомогою break.
    reverse_A=A[::-1]

    count=0 #лічильни для суми чисел до min значення.
    count1=-1 #лічильник для підрахунку чисел, які зустрілись до min значення (нумерація\
    #з -1 тому, що ми не включаємо A_min, а у count(що рахує значення, ми потім віднімемо\
    #це A_min)).
    
    for i in range(len(reverse_A)): #[22,23,18,28,27]
        count+=reverse_A[i] #22+23+18=63
        count1+=1 # -1+1+1+1=2
        if reverse_A[i]==A_min:
            break

    if count1==0:
        print('Середнє значення: ', count)
    else:
        count_out_min=count-A_min # 63-18=45
        average_A=count_out_min/(count1) #45/2=22,5
        print('Середнє значення чисел після знайденого мінімального значення: ', average_A)

    #Бажаєте відтворити програму заново?
    result=input('Введіть "1" щоб продовжити та щось інше - для виходу: ')
    if result=='1':
        continue
    break

    
    
