#31. Обчислити середнє арифметичне значення тих елементів одновимірного
#масиву, які потрапляють в інтервал від -2 до 10.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(-4,15) for i in range(15)])

    print('Масив: ', A)

    count=0 #Підрахунок суми чисел, які потрапляють у інтервал від -2 до 10.
    count1=0 #Підрахунок чисел, які потрапляють у інтервал від -2 до 10.
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if -2<=A[i]<=10: #Пошук того елемента, який потрапляє у вказаний інтервал.
            count+=A[i] #Сумуємо ці числа.
            count1+=1 #Сумуємо їх кількість.

    average=0
    if count1==0 and count==0: #Якщо count's==0, то таких чисел немає у масиві.
        print('Немає елементів у масиві зі значеннями від -2 до 10.')

    else: #якщо є, то обраховуємо їх середнє арифметичне:
        average=count/count1
    print('Середнє значення елементів, які лежать у інтервалі (-2,10): ', average)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

