#34. Дано два лінійних масиву однакової розмірності. Скласти третій масив з
#добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масиви рандомними числами:
    A=np.array([random.randint(-5,5) for i in range(20)])
    B=np.array([random.randint(-5,5) for i in range(20)])

    print('Масив А: ', A)
    print('Масив В: ', B)

    C=A*B #При множенні масивів будуть пепемножатись\
    #елементи з однаковими індексами.
    print('Результат множення матриць А та В: ', C)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

