#39. Дані про температуру повітря і кількості опадів за декаду квітня
#зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у
#вигляді снігу за цю декаду.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np
import random

while True:
    #Генеруємо температуру та к-сть опадів.
    A=np.array([random.randint(-10,20) for i in range(10)])
    B=np.array([random.randint(1,10) for i in range(10)])


    print('Температура: ', A)
    print('Кількість опадів: ', B)

    count=0
    count1=0

    for i in range(10):
        if A[i]>=0: #Якщо наша температура буде вищою, ніж 0:
            count1+=B[i] #То ми будемо у лічильник додавати значення
            #опадів, які знаходяться під тим індексом, що й додатня\
            #температура А.
        if A[i]<0: #Тут ми виконуємо зворотнє.
            count+=B[i]

    #Виводимо ці значення.           
    print(f'Сума опадів у ті дні, коли температура була нижчою, \
    ніж 0 градусів (тобто падав сніг): {count}.')

    print(f'Сума опадів у ті дні, коли температура була вищою, \
    ніж 0 градусів (тобто падав дощ): {count1}.')

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
    


                
            




