#4. Створіть масив з 5 прізвищ і виведіть на екран ті з них, які
#починаються з певної букви, яка вводиться з клавіатури.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np

while True:
    n=input('Введіть літеру, з якої починатиметься прізвище: ') #Введіть літеру.
    A=np.array([input('Введіть прізвище: ') for i in range(5)]) #Прізвище.
        
    for k in A: #тримаємо доступ до елементів
        if k[0]==n: #Перевіримо, чи перша буква і є тою, яку ми ввели в n.
            print(k)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
