#Обчислити суму парних елементів одновимірного масиву до першого зустрінутого
#нулевого елемента.

#Підготував студент 1-го курсу групи 122Б, Суханов Андрій Олександрович.

import numpy as np #Імпортуємо numpy.

while True:
    while True:
        #Ініціалізуємо масив нулями.
        A=np.zeros(8, dtype=int)

        count=0
        for i in range(len(A)): #Отримуємо доступ до елементів матриці А.
            try: #Перевірка на входження чисел.
                A[i] =int(input('Введіть елементи масиву: '))
                continue
            except ValueError:
                print('Input numbers!! ')
                break
            
        for i in range(len(A)): #Отримуємо доступ до елементів матриці А.   
            if A[i]!=0: #Шукаємо суму елементів, доти, поки А не буде = 0.
                count+=A[i]
            else:
                break #Якщо зустрівся 0, то далі сума не обраховується.
        print('Сума елементів масиву до нуля: ', count)


        #Чи бажаєте повторити програму?
        result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
        if result=='1':
            continue
        break
    break
