#42. Підрахувати кількість елементів одновимірного масиву, для яких
#виконується нерівність i*i<A[i]<i!

#Підготував Суханов Андрій Олександрович, студент 1-го курсу групи 122Б

import numpy as np #Імпортуємо numpy, random.
import random
import math

while True:
    #Генеруємо масив рандомними числами.
    A=np.array([random.randint(5,20) for i in range(10)])
    print('Масив: ', A)

    count=0
    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if i*i<A[i]<math.factorial(i): #Умова задачі.
            count+=1 #Якщо виконується, то у лічильник +1.

    #Якщо лічильник не збільшився, то таких числе немає.
    if count==0:
        print('Немає у масиві елементів, що задовільняють умову i*i<A[i]<i')
    else:
        print('Кількість елементів, що задовільняють умову i*i>A[i]>i: ', count)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
    
