#46. Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
#повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
#назву першого товару з таблиці.

#Підготував Суханов Андрій Олександрович, 122Б

import numpy as np 

while True:
    #Користувач вводить назву товарів.
    A=[input('Введіть товар: ') for i in range(5)]
    print(A)

    flag=False
    for i in range(len(A)): #Отримаємо доступ до елментів списку.
        if A[0] in A[1:]: #за допомогою зрізу перевіримо чи є такі ще\
            #елементи у списку.
            A.remove(A[0]) #Якщо є, то видалимо перший елемент.
            flag=True

    if not flag: #За допомогою прапорця, виведемо повідомлення на екран.
        print('Таких товарів, як перший, немає у таблиці.')
    else:
        print('У таблиці є такі товари, як перший, тому видалимо перший: ', A)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

