#47. У лінійному масиві знайти максимальний елемент. Вставте порядковий
#номер елемента за ним, пересунувши всі залишилися на одну позицію вправо.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np
import random

while True:
    #Генеруємо масив рандомними числами.
    A=np.array([random.randint(5,20) for i in range(10)])
    print('Масив: ', A)

    maxx=0 #це буде наш макс. індекс.
    lst_maxindex=[] #Сюди ми додамо індекс макс. елемента.
    lst_minus=[]#Тут ми розмістимо елементи, що знаходяться ліворуч\
    #від макс. числа.
    lst_plus=[]#Тут елементи, що праворуч.
    massive=[] #В кінці ми створимо потрібний нам масив.

    for i in range(len(A)): #Отримаємо доступ до елементів масиву.
        if A[i]>maxx: #Шукаємо максимальний індекс. 
            maxx=A[i] #Знайшли. Присвоємо його змінній.
            maxx_i=i #Його індекс теж присвоємо змінній.
    for j in range(len(A)):
        if j<=maxx_i: #Якщо індекс масиву менший індекса макс.числа, 
            lst_minus.append(A[j]) #То додамо ці числа у масив, що стосується\
            # "лівого борту".
            if j==maxx_i: #Індекс макс. числа також додамо у список.
                lst_maxindex.append(j)
        else:
            lst_plus.append(A[j])

    #Ось тут і створимо потрібну нам послідовність.
    massive=lst_minus+lst_maxindex+lst_plus

    print(f'Максимальне число {maxx}  індексом {maxx_i}.')
    print()
    print(f'Сформуємо наш масив таким чином: після максимального елемента \
поставимо його індекс, а далі пересунемо всі елементи на позицію праворуч.')
    print()
    print(massive)

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
            


    
    
    
