#5. Створіть масив А [1..7] за допомогою генератора випадкових чисел і
#виведіть його на екран. Збільште всі його елементи в 2 рази.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy та random.
import random

while True:
    A=np.zeros(7, int) #Ініціалізуємо пусту матрицю.
    for i in A: #Отримуємо доступ до елементів матриці А.
        for j in A: 
            A[j]=random.randint(-5,5) #згенеруємо елементи для матриці.
    print('Масив: ', A) #Виведемо наш масив на екран.

    print('Масив х2: ')
    for i in A: #Отримуємо доступ до елементів матриці А.
        for j in A:
            A=map(lambda j: j*2, A) #За допомогою lambda помножимо елементи на 2.
            for i in A: #Оскільки lambda - анонімна функція, то елементи її \
                #виведемо так:
                print(i, end=' ')
    print()

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
