#50. У лотереї розігрувалося 100 квитків. Таблиця містить 10 номерів
#виграшних квитків. Перевірте, чи є квиток з номером N виграшним.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np
import random

while True:
    #Ініціалізуємо 10 виграшних квитків та 10 квитків, що купив користувач.
    A=np.array([random.randint(1,100) for i in range(10)])
    B=np.array([random.randint(1,100) for i in range(10)])

    print('Виграшні квитки: ', A)
    print('Ваші квитки: ', B)

    flag=False
    for j in range(len(B)): #Отримаємо доступ до елементів масиву В.
        if B[j] in A: #Перевіряємо на входження квитка користувача у виграшні.
            flag=True
        else:
            flag=False

    #Якщо істина - то користувач виграв, інакше - ні(
    if flag==True:
        print(f'Вітаємо ваш білет {B[j]} - виграшний!')
    else:
        print('Ви нещасливий. У вас не виявлено жодного виграшного квитка(')


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

            

