#51. Дан одновимірний масив а. Сформувати новий масив, який складається
#тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
#елементів немає, то видати повідомлення.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(1,20) for i in range(10)])
    print('Масив: ', A)

    lst=[]
    flag=False
    for i in range(len(A)):#Отримаємо доступ до елементів масиву.
        if A[i]>i+10: #Умова: якщо номер елементу + 10 менший, ніж число, то:
            lst.append(A[i]) #додаємо його у список.
            flag=True #Умова правильна, якщо є такі елементи.


    if flag==True: #Якщо умова прпвильна, то на екран виведемо ці елементи.
        array=np.array(lst)
        print('Елементи, які перевищують свій номер на 10: ', array)
    else: #Якщо ні, то повідомлення:
        print('Немає у масиві таких елементів, що перевищують свій номер на 10!')


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break     




