#52. Знайти найбільший елемент з елементів одновимірного масиву, що мають
#парний номер. Визначити, чи є він єдиним.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо масив числами:
    A=np.array([random.randint(20,50) for i in range(15)])
    print('Масив: ', A)

    count=0
    lst=[]
    for i in range(len(A)): #Отримаємо доступ до елментів масиву.
        if i%2==0: #будемо шукати максимальне число лише серед\
            #парних індексів:
            lst.append(A[i])
            A_max=max(lst)
    for i in range(len(lst)):
        if A_max==lst[i]: #Будемо перевіряти, чи максимальне число єдине.
            count+=1
            
    print('Найбільше число у масиві під парним індексом: ', A_max)

    #Якщо максимальне число єдине під парним номером у послідовності, то \
    #Використовуємо гілку if, якщо ні - else.
    if count==1:
        print('Максимальне число єдине під парним номером.')
    else:
        print(f'Максимальне число не єдине під парним індексом \
та повторилось кількіссть разів: {count}.')
        

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
