#55. У будинку, що складається з 30 квартир, переселити мешканців так, щоб
#мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29
#і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо скільки мешканців проживатиме у кожній з квартир:
    A=np.array([random.randint(2,6) for i in range(30)])
    print('Кількість мешканців у кожній з 30 квартир: ', A)

    #Тепер: за умовою задачі потрібно змінити місцями 30 квартиру мешканців з першою, \
    #29 - з другою. Якщо ми візьмемо, наприклад, 6 квартир, то будемо мати: \
    #[1,2,3,4,5,6] . Змінимо 6 номер з першим, 5 з другим, і тд,  отримаємо: [6,5,4,3,2,1].
    #Тобто, по суті, відбувається "обертання" масиву, - функція reverse. Отже, ми можемо \
    #пересилити наших мешканців за допомогою операції:
    A_rev=A[::-1]
    print('Після обміну квартирами, мешканці живуть так: ', A_rev)

    #Також потрібно знайти квартири, у яких прожтвають багатодітні сім'ї, а саме: більше 5 людей.
    #Отже:
    count=0
    for i in range(len(A)):
        if A[i]>5:
            count+=1
    #Якщо лічильник у нас все ще = 0, то у будинку немає сімей, де живе більше 5 людей.
    if count==0:
        print('Немає квартир, у яких проживає більше, ніж 5 мешканців.')
    #Якщо !=0, то:
    else:
        print(f'Кількість квартир, у яких проживає більше 5 мешканців - {count}.')


    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

