#6. Створіть масив А [1..8] за допомогою генератора випадкових чисел з
#елементами від -10 до 10 і виведіть його на екран. Підрахуйте кількість від’ємних
#елементів масиву.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy та random.
import random

while True:
    #згенеруємо наш масив.
    A=np.array([random.randint(-10, 10) for i in range(8)])

    print('Масив: ', A) #виведемо на екран.

    count=0 #запустимо лічильник.
    for i in range(len(A)): #Отримаємо доступ до елементів масиву А.
        if A[i]<0: #Якщо числа від'ємні, то count врахує це число.
            count+=1
    #Виведемо наш count.
    print('Кількість від"ємних елементів: ', count)
    print()

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break
        
