#7. Створіть масив А [1..12] за допомогою генератора випадкових чисел з
#елементами від -20 до 10 і виведіть його на екран. Замініть всі від’ємні елементи
#масиву числом.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #імпортуємо numpy та random.
import random

while True:
    #Згенеруємо наш масив
    A=np.array([random.randint(-20,10) for i in range(12)])

    print('Масив: ', A) #Виведемо наш масив.

    for i in range(len(A)): #Отримуємо доступ до елементів матриці А.
        if A[i]<0: #Якщо у масиві буде число менше 0 (від'ємне), то замінимо \
            #його на 666.
            A[i]=666
    print(A)
    print()

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

