#8. Створіть цілочисельний масив А [1..15] за допомогою генератора
#випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте
#найбільший елемент масиву і його індекс.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random
import random

while True:
    #Згенеруємо масив А.
    A=np.array([random.randint(-15,30) for i in range(15)])

    print('Масив: ', A)

    for i in range(len(A)): #Отримуємо доступ до елементів матриці А.
        A_max=max(A) #Знайдемо найбільше значення.
        if A_max==A[i]: #Знайдемо число у масиві і його індекс.
            print(f'Найбільше значення: {A_max} з індексом {i}')
            break

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break

    

