#9. З 8 до 20 години температура повітря вимірювалася щогодини. Відомо,
#що протягом цього часу температура знижувалася. Визначте, о котрій годині було
#вперше зафіксовано від'ємну температуру.

#Підготував Суханов Андрій Олександрович, 122Б.

import numpy as np #Імпортуємо numpy, random.
import random

while True:
    #Генеруємо матриці А, В.
    A=np.array(range(8,21)) #для годин
    B=np.array([random.randint(-5,5) for i in range(8,21)]) #для температури.
    print('Години: ', A) 
    print('Температура: ', B)

    for i in range(len(B)): #Отримуємо доступ до елементів матриці B.
        if B[i]>=0: #Ми не враховуємо додатню температуру, тому переходимо \
            #відразу в else.
            continue
        else:
            print(f"Температура знизилась до {B[i]} у {i+8} годин.")
        break

    #Чи бажаєте повторити програму?
    result=input('Введіть "1", щоб продовжити, інше - для виходу: ')
    if result=='1':
        continue
    break



        
        
        
            
        

